In [5]:
import pandas as pd
import numpy as np

In [6]:
A = [1,2,3,4]
B = [5,6,7,8]
C = [9,0,1,2]
D = [3,4,5,6]

In [7]:
df = pd.DataFrame([A,B,C,D],['a','b','c','d'],['name','age','colge','adres'])

In [8]:
df['helo'] = df['name']+df['adres']

In [9]:
df

   name  age  colge  adres  helo
a     1    2      3      4     5
b     5    6      7      8    13
c     9    0      1      2    11
d     3    4      5      6     9

In [10]:
df['helo']

a     5
b    13
c    11
d     9
Name: helo, dtype: int64

In [11]:
df.loc['d']
#specific row accessing

name     3
age      4
colge    5
adres    6
helo     9
Name: d, dtype: int64

In [12]:
df.iloc[2]
#for index base accessing

name      9
age       0
colge     1
adres     2
helo     11
Name: c, dtype: int64

In [13]:
#for specific element:
df.loc['c','name']

9

In [15]:
###############
#############
##########
#######
####
##
#conditions



df[df > 5]

   name  age  colge  adres  helo
a   NaN  NaN    NaN    NaN   NaN
b   NaN  6.0    7.0    8.0  13.0
c   9.0  NaN    NaN    NaN  11.0
d   NaN  NaN    NaN    6.0   9.0

In [16]:
df[df['name']>3]

   name  age  colge  adres  helo
b     5    6      7      8    13
c     9    0      1      2    11

In [21]:
df[df['name']>3][['name','adres']]

   name  adres
b     5      8
c     9      2

In [22]:
df[df['name']>3][['age','adres']]

   age  adres
b    6      8
c    0      2

In [23]:
df[(df['name']>3) &(df['age']>2) ]

   name  age  colge  adres  helo
b     5    6      7      8    13